src/cf/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновитьСодержание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбновитьСодержаниеФайлов/Ext/Module.bsl
Процедура ОбновитьСодержаниеФайлов() Экспорт
	
	Выб = Справочники.Файлы.Выбрать(,,Новый Структура ("ОбновитьСодержание", Истина));
	Пока Выб.Следующий() Цикл
		
		Об = Выб.ПолучитьОбъект();
		Об.ОбменДанными.Загрузка = Истина;
		Об.ОбновитьСодержание = Ложь;
		ВременныйФайл = ПолучитьИмяВременногоФайла();
	    Об.Данные.Получить().Записать(ВременныйФайл);
		Кодировка = "ANSI";
		КодировкаФайла = КодировкаТекста[Кодировка];
		Чтение = Новый ЧтениеТекста(ВременныйФайл, КодировкаФайла);
		Об.Содержание = Чтение.Прочитать();
		Чтение.Закрыть();
		УдалитьФайлы(ВременныйФайл);
		Об.Записать();

	КонецЦикла;

КонецПроцедуры
